#!/usr/bin/python3
# -*- coding: utf-8 -*-
import pickle

# data = pd.DataFrame({'Sample': range(1, 11), 'age': ['18', '20', '18', '18', '19', '21', '19', '20', '21', '21'],
# #                      'Gender': ['Female', 'Male', 'Female', 'Male', 'Male', 'Male', 'Female', 'Female', 'Male',
# #                                 'Female'],
# #                     'Handedness': ['Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed', 'Left-handed', 'Right-handed', 'Right-handed']})
# # # 方法一：用pivot_table
# # # 其实我觉的一点都不麻烦ε=(´ο｀*)))唉
# # data.pivot_table(index=['Gender','age'], columns='Handedness', aggfunc=len, margins=True)
# # # 方法二：用crosstab
# # tab = pd.crosstab([data.Gender,data.age], [data.Handedness], margins=True)
# # print(tab)
from functools import reduce


class Row:
    pass


class Col:
    pass


class Value:
    pass


def assemble_table(rsp):
    columnList = rsp.get("columnList")
    records = rsp.get("data").get("records")
    idxs = {}  # key:columnList index value:column
    # 行維度 key:row1_row2 value: [row1,row2]
    rows = {}
    # 列維度 key:col1_col2 value: [col1,col2]
    cols = {}
    # 指标 {"row1_row2":{"col1_col2":[value1,value2]}}
    values = {}
    for column in columnList:
        idxs[column["index"]] = column
    # print("列索引:%s" % idxs)
    for i, record in enumerate(records):
        val_rows = []
        val_cols = []
        vals = []
        for j, element in enumerate(record):
            # 列維
            if idxs[j].get("colType") == "cols":
                # 设置列属性
                col = Col()
                col.name = element
                col.level = j
                val_cols.append(col)
            else:
                if len(val_cols) > 0:
                    key = "_".join([o.name for o in val_cols])
                    if key in cols:
                        pass
                    else:
                        cols[key] = val_cols

            if idxs[j].get("colType") == "rows":
                # 设置列属性
                row = Row()
                row.name = element
                row.level = j
                val_rows.append(row)
            else:
                if len(val_rows) > 0:
                    key = "_".join([o.name for o in val_rows])
                    if key in rows:
                        pass
                    else:
                        rows[key] = val_rows
            # 指标
            if idxs[j].get("colType") == "indexs":
                if element in rows:
                    pass
                else:
                    # 设置列属性
                    value = Value()
                    value.name = idxs[j]
                    value.value = element
                    value.row = "_".join([o.name for o in val_rows])
                    value.col = "_".join([o.name for o in val_cols])
                    vals.append(value)
        r = "_".join([o.name for o in val_rows])
        c = "_".join([o.name for o in val_cols])
        # 已经包含行
        if r in values:
            v = values.get(r)
            v[c] = vals
        else:
            values[r] = {c: vals}

            # print(values)
    sorted_cols= sorted(cols.keys())
    print(",".join(["---" for i in range(2 + len(cols.keys()))]))
    print("---,", "---,", ",".join(sorted_cols))
    print("季度,", "公司类型,", ",".join(["客户数" for i in range(len(cols.keys()))]))
    for r, v in rows.items():
        tmp = [x.name for x in v]
        val = values.get(r)
        for c in sorted_cols:
            if c in val:
                tmp.append("".join([x.value for x in val.get(c)]))
            else:
                tmp.append("0")
        print(",".join(tmp))


rsp = {"columnList": [{"alias": "季度", "colType": "cols", "index": 0, "name": "statis_quarter"},
                      {"alias": "公司类型", "colType": "rows", "index": 1, "name": "comp_type"},
                      {"alias": "客户等级", "colType": "rows", "index": 2, "name": "comp_priority"},
                      {"aggType": "distinct", "alias": "公司数量", "colType": "indexs", "index": 3, "name": "comp_id"}],
       "data": {"records": [["2018Q2", "P2P", "一般客户", "45"], ["2018Q3", "P2P", "SME客户", "160"],
                            ["2018Q4", "P2P", "公司级重点客户", "8"], ["2019Q1", "P2P", "公司级重点客户", "8"],
                            ["2018Q2", "P2P", "区域级重点客户", "9"], ["2018Q3", "P2P", "公司级重点客户", "7"],
                            ["2018Q1", "P2P", "-", "5"], ["2018Q1", "P2P", "一般客户", "38"], ["2018Q4", "P2P", "-", "6"],
                            ["2019Q1", "P2P", "-", "6"], ["2018Q2", "P2P", "SME客户", "156"], ["2018Q3", "P2P", "-", "6"],
                            ["2018Q1", "P2P", "区域级重点客户", "9"], ["2018Q4", "P2P", "一般客户", "54"],
                            ["2019Q1", "P2P", "一般客户", "54"], ["2018Q2", "P2P", "公司级重点客户", "6"],
                            ["2019Q1", "P2P", "区域级重点客户", "13"], ["2018Q3", "P2P", "一般客户", "49"],
                            ["2018Q4", "P2P", "区域级重点客户", "13"], ["2018Q3", "P2P", "区域级重点客户", "12"],
                            ["2018Q1", "P2P", "SME客户", "151"], ["2018Q2", "P2P", "-", "6"],
                            ["2018Q1", "P2P", "公司级重点客户", "6"], ["2018Q4", "P2P", "SME客户", "162"],
                            ["2019Q1", "P2P", "SME客户", "162"], ["2018Q3", "T1T2", "区域级重点客户", "11"],
                            ["2018Q1", "T1T2", "-", "2"], ["2019Q1", "T1T2", "-", "2"],
                            ["2018Q1", "T1T2", "公司级重点客户", "17"], ["2018Q4", "T1T2", "-", "2"],
                            ["2018Q2", "T1T2", "一般客户", "2"], ["2019Q1", "T1T2", "公司级重点客户", "22"],
                            ["2018Q3", "T1T2", "-", "2"], ["2018Q4", "T1T2", "公司级重点客户", "21"],
                            ["2018Q2", "T1T2", "区域级重点客户", "11"], ["2018Q3", "T1T2", "公司级重点客户", "18"],
                            ["2018Q1", "T1T2", "一般客户", "1"], ["2018Q2", "T1T2", "-", "2"],
                            ["2019Q1", "T1T2", "一般客户", "2"], ["2018Q1", "T1T2", "区域级重点客户", "6"],
                            ["2018Q4", "T1T2", "一般客户", "2"], ["2018Q2", "T1T2", "公司级重点客户", "18"],
                            ["2019Q1", "T1T2", "区域级重点客户", "11"], ["2018Q3", "T1T2", "一般客户", "2"],
                            ["2018Q4", "T1T2", "区域级重点客户", "11"], ["2019Q1", "T3", "SME客户", "1"],
                            ["2018Q1", "T3", "公司级重点客户", "4"], ["2018Q4", "T3", "SME客户", "1"],
                            ["2018Q2", "T3", "一般客户", "56"], ["2019Q1", "T3", "公司级重点客户", "5"],
                            ["2018Q3", "T3", "SME客户", "1"], ["2018Q4", "T3", "公司级重点客户", "5"],
                            ["2018Q2", "T3", "区域级重点客户", "50"], ["2018Q3", "T3", "公司级重点客户", "4"],
                            ["2018Q1", "T3", "-", "1"], ["2019Q1", "T3", "-", "1"], ["2018Q1", "T3", "一般客户", "48"],
                            ["2018Q4", "T3", "-", "1"], ["2018Q2", "T3", "SME客户", "1"], ["2019Q1", "T3", "一般客户", "71"],
                            ["2018Q3", "T3", "-", "1"], ["2018Q1", "T3", "区域级重点客户", "45"],
                            ["2018Q4", "T3", "一般客户", "70"], ["2018Q2", "T3", "公司级重点客户", "4"],
                            ["2019Q1", "T3", "区域级重点客户", "62"], ["2018Q3", "T3", "一般客户", "61"],
                            ["2018Q4", "T3", "区域级重点客户", "62"], ["2018Q3", "T3", "区域级重点客户", "59"],
                            ["2018Q1", "T3", "SME客户", "1"], ["2018Q2", "T3", "-", "1"],
                            ["2018Q2", "互金", "区域级重点客户", "25"], ["2018Q3", "互金", "公司级重点客户", "8"],
                            ["2018Q1", "互金", "-", "8"], ["2019Q1", "互金", "-", "9"], ["2018Q1", "互金", "一般客户", "25"],
                            ["2018Q4", "互金", "-", "9"], ["2018Q2", "互金", "SME客户", "181"],
                            ["2019Q1", "互金", "一般客户", "33"], ["2018Q3", "互金", "-", "9"],
                            ["2018Q1", "互金", "区域级重点客户", "23"], ["2018Q4", "互金", "一般客户", "33"],
                            ["2018Q2", "互金", "公司级重点客户", "7"], ["2019Q1", "互金", "区域级重点客户", "28"],
                            ["2018Q3", "互金", "一般客户", "33"], ["2018Q4", "互金", "区域级重点客户", "28"],
                            ["2018Q3", "互金", "区域级重点客户", "27"], ["2018Q1", "互金", "SME客户", "162"],
                            ["2018Q2", "互金", "-", "8"], ["2019Q1", "互金", "SME客户", "188"],
                            ["2018Q1", "互金", "公司级重点客户", "7"], ["2018Q4", "互金", "SME客户", "188"],
                            ["2018Q2", "互金", "一般客户", "30"], ["2019Q1", "互金", "公司级重点客户", "8"],
                            ["2018Q3", "互金", "SME客户", "186"], ["2018Q4", "互金", "公司级重点客户", "8"],
                            ["2019Q1", "保险", "-", "2"], ["2018Q1", "保险", "一般客户", "7"], ["2018Q4", "保险", "-", "2"],
                            ["2018Q2", "保险", "SME客户", "4"], ["2019Q1", "保险", "一般客户", "8"], ["2018Q3", "保险", "-", "2"],
                            ["2018Q1", "保险", "区域级重点客户", "3"], ["2018Q4", "保险", "一般客户", "8"],
                            ["2018Q2", "保险", "公司级重点客户", "2"], ["2019Q1", "保险", "区域级重点客户", "6"],
                            ["2018Q3", "保险", "一般客户", "7"], ["2018Q4", "保险", "区域级重点客户", "6"],
                            ["2018Q3", "保险", "区域级重点客户", "5"], ["2018Q1", "保险", "SME客户", "4"],
                            ["2018Q2", "保险", "-", "2"], ["2019Q1", "保险", "SME客户", "7"],
                            ["2018Q1", "保险", "公司级重点客户", "2"], ["2018Q4", "保险", "SME客户", "7"],
                            ["2018Q2", "保险", "一般客户", "7"], ["2019Q1", "保险", "公司级重点客户", "5"],
                            ["2018Q3", "保险", "SME客户", "6"], ["2018Q4", "保险", "公司级重点客户", "5"],
                            ["2018Q2", "保险", "区域级重点客户", "5"], ["2018Q3", "保险", "公司级重点客户", "4"],
                            ["2018Q1", "保险", "-", "2"], ["2019Q1", "其他", "一般客户", "60"], ["2018Q3", "其他", "-", "13"],
                            ["2018Q1", "其他", "区域级重点客户", "12"], ["2018Q4", "其他", "一般客户", "58"],
                            ["2018Q2", "其他", "公司级重点客户", "2"], ["2019Q1", "其他", "区域级重点客户", "22"],
                            ["2018Q3", "其他", "一般客户", "47"], ["2018Q4", "其他", "区域级重点客户", "22"],
                            ["2018Q3", "其他", "区域级重点客户", "19"], ["2018Q1", "其他", "SME客户", "147"],
                            ["2018Q2", "其他", "-", "13"], ["2019Q1", "其他", "SME客户", "234"],
                            ["2018Q1", "其他", "公司级重点客户", "2"], ["2018Q4", "其他", "SME客户", "233"],
                            ["2018Q2", "其他", "一般客户", "36"], ["2019Q1", "其他", "公司级重点客户", "3"],
                            ["2018Q3", "其他", "SME客户", "207"], ["2018Q4", "其他", "公司级重点客户", "3"],
                            ["2018Q2", "其他", "区域级重点客户", "13"], ["2018Q3", "其他", "公司级重点客户", "2"],
                            ["2018Q1", "其他", "-", "12"], ["2019Q1", "其他", "-", "14"], ["2018Q1", "其他", "一般客户", "30"],
                            ["2018Q4", "其他", "-", "14"], ["2018Q2", "其他", "SME客户", "172"],
                            ["2018Q3", "其他持牌", "区域级重点客户", "18"], ["2018Q1", "其他持牌", "SME客户", "139"],
                            ["2018Q2", "其他持牌", "-", "4"], ["2019Q1", "其他持牌", "SME客户", "188"],
                            ["2018Q1", "其他持牌", "公司级重点客户", "7"], ["2018Q4", "其他持牌", "SME客户", "188"],
                            ["2018Q2", "其他持牌", "一般客户", "35"], ["2019Q1", "其他持牌", "公司级重点客户", "8"],
                            ["2018Q3", "其他持牌", "SME客户", "183"], ["2018Q4", "其他持牌", "公司级重点客户", "8"],
                            ["2018Q2", "其他持牌", "区域级重点客户", "14"], ["2018Q3", "其他持牌", "公司级重点客户", "8"],
                            ["2018Q1", "其他持牌", "-", "4"], ["2019Q1", "其他持牌", "-", "4"],
                            ["2018Q1", "其他持牌", "一般客户", "27"], ["2018Q4", "其他持牌", "-", "4"],
                            ["2018Q2", "其他持牌", "SME客户", "169"], ["2019Q1", "其他持牌", "一般客户", "42"],
                            ["2018Q3", "其他持牌", "-", "4"], ["2018Q1", "其他持牌", "区域级重点客户", "10"],
                            ["2018Q4", "其他持牌", "一般客户", "41"], ["2018Q2", "其他持牌", "公司级重点客户", "7"],
                            ["2019Q1", "其他持牌", "区域级重点客户", "21"], ["2018Q3", "其他持牌", "一般客户", "37"],
                            ["2018Q4", "其他持牌", "区域级重点客户", "21"], ["2018Q2", "其他消费金融", "-", "4"],
                            ["2019Q1", "其他消费金融", "SME客户", "72"], ["2018Q1", "其他消费金融", "公司级重点客户", "3"],
                            ["2018Q4", "其他消费金融", "SME客户", "72"], ["2018Q2", "其他消费金融", "一般客户", "31"],
                            ["2019Q1", "其他消费金融", "公司级重点客户", "5"], ["2018Q3", "其他消费金融", "SME客户", "69"],
                            ["2018Q4", "其他消费金融", "公司级重点客户", "5"], ["2018Q2", "其他消费金融", "区域级重点客户", "15"],
                            ["2018Q3", "其他消费金融", "公司级重点客户", "5"], ["2018Q1", "其他消费金融", "-", "4"],
                            ["2019Q1", "其他消费金融", "-", "4"], ["2018Q1", "其他消费金融", "一般客户", "28"],
                            ["2018Q4", "其他消费金融", "-", "4"], ["2018Q2", "其他消费金融", "SME客户", "64"],
                            ["2019Q1", "其他消费金融", "一般客户", "36"], ["2018Q3", "其他消费金融", "-", "4"],
                            ["2018Q1", "其他消费金融", "区域级重点客户", "14"], ["2018Q4", "其他消费金融", "一般客户", "35"],
                            ["2018Q2", "其他消费金融", "公司级重点客户", "4"], ["2019Q1", "其他消费金融", "区域级重点客户", "17"],
                            ["2018Q3", "其他消费金融", "一般客户", "33"], ["2018Q4", "其他消费金融", "区域级重点客户", "17"],
                            ["2018Q3", "其他消费金融", "区域级重点客户", "16"], ["2018Q1", "其他消费金融", "SME客户", "57"],
                            ["2019Q1", "小贷公司", "区域级重点客户", "2"], ["2018Q3", "小贷公司", "一般客户", "2"],
                            ["2018Q4", "小贷公司", "区域级重点客户", "2"], ["2019Q1", "小贷公司", "SME客户", "43"],
                            ["2018Q4", "小贷公司", "SME客户", "43"], ["2019Q1", "小贷公司", "公司级重点客户", "1"],
                            ["2018Q3", "小贷公司", "SME客户", "5"], ["2018Q4", "小贷公司", "公司级重点客户", "1"],
                            ["2019Q1", "小贷公司", "一般客户", "9"], ["2018Q4", "小贷公司", "一般客户", "9"],
                            ["2019Q1", "持牌汽车金融", "SME客户", "1"], ["2018Q3", "持牌汽车金融", "SME客户", "1"],
                            ["2018Q4", "持牌汽车金融", "SME客户", "1"], ["2018Q2", "持牌消费金融", "区域级重点客户", "8"],
                            ["2019Q1", "持牌消费金融", "-", "2"], ["2018Q3", "持牌消费金融", "-", "2"],
                            ["2018Q4", "持牌消费金融", "-", "2"], ["2018Q1", "持牌消费金融", "-", "2"],
                            ["2019Q1", "持牌消费金融", "一般客户", "2"], ["2018Q3", "持牌消费金融", "一般客户", "2"],
                            ["2018Q4", "持牌消费金融", "一般客户", "2"], ["2018Q1", "持牌消费金融", "一般客户", "2"],
                            ["2018Q2", "持牌消费金融", "SME客户", "5"], ["2019Q1", "持牌消费金融", "区域级重点客户", "9"],
                            ["2018Q3", "持牌消费金融", "区域级重点客户", "8"], ["2018Q4", "持牌消费金融", "区域级重点客户", "9"],
                            ["2018Q1", "持牌消费金融", "区域级重点客户", "8"], ["2018Q2", "持牌消费金融", "公司级重点客户", "9"],
                            ["2019Q1", "持牌消费金融", "SME客户", "6"], ["2018Q3", "持牌消费金融", "SME客户", "5"],
                            ["2018Q4", "持牌消费金融", "SME客户", "6"], ["2018Q1", "持牌消费金融", "SME客户", "5"],
                            ["2018Q2", "持牌消费金融", "-", "2"], ["2019Q1", "持牌消费金融", "公司级重点客户", "9"],
                            ["2018Q3", "持牌消费金融", "公司级重点客户", "9"], ["2018Q4", "持牌消费金融", "公司级重点客户", "9"],
                            ["2018Q1", "持牌消费金融", "公司级重点客户", "9"], ["2018Q2", "持牌消费金融", "一般客户", "2"],
                            ["2018Q1", "未知", "-", "51"], ["2019Q1", "未知", "一般客户", "138"],
                            ["2018Q3", "未知", "一般客户", "50"], ["2018Q4", "未知", "一般客户", "86"],
                            ["2018Q1", "未知", "一般客户", "25"], ["2018Q2", "未知", "SME客户", "119"],
                            ["2019Q1", "未知", "区域级重点客户", "94"], ["2018Q3", "未知", "区域级重点客户", "24"],
                            ["2018Q4", "未知", "区域级重点客户", "64"], ["2018Q1", "未知", "区域级重点客户", "12"],
                            ["2018Q2", "未知", "公司级重点客户", "17"], ["2019Q1", "未知", "SME客户", "335"],
                            ["2018Q3", "未知", "SME客户", "178"], ["2018Q4", "未知", "SME客户", "263"],
                            ["2018Q1", "未知", "SME客户", "86"], ["2018Q2", "未知", "-", "61"],
                            ["2019Q1", "未知", "公司级重点客户", "73"], ["2018Q3", "未知", "公司级重点客户", "25"],
                            ["2018Q4", "未知", "公司级重点客户", "67"], ["2018Q1", "未知", "公司级重点客户", "9"],
                            ["2018Q2", "未知", "一般客户", "32"], ["2018Q2", "未知", "区域级重点客户", "17"],
                            ["2019Q1", "未知", "-", "98"], ["2018Q3", "未知", "-", "69"], ["2018Q4", "未知", "-", "91"],
                            ["2018Q2", "汽车金融", "SME客户", "156"], ["2019Q1", "汽车金融", "区域级重点客户", "13"],
                            ["2018Q3", "汽车金融", "区域级重点客户", "13"], ["2018Q4", "汽车金融", "区域级重点客户", "13"],
                            ["2018Q1", "汽车金融", "区域级重点客户", "12"], ["2018Q2", "汽车金融", "公司级重点客户", "5"],
                            ["2019Q1", "汽车金融", "SME客户", "203"], ["2018Q3", "汽车金融", "SME客户", "182"],
                            ["2018Q4", "汽车金融", "SME客户", "203"], ["2018Q1", "汽车金融", "SME客户", "117"],
                            ["2018Q2", "汽车金融", "-", "3"], ["2019Q1", "汽车金融", "公司级重点客户", "5"],
                            ["2018Q3", "汽车金融", "公司级重点客户", "5"], ["2018Q4", "汽车金融", "公司级重点客户", "5"],
                            ["2018Q1", "汽车金融", "公司级重点客户", "4"], ["2018Q2", "汽车金融", "一般客户", "40"],
                            ["2018Q2", "汽车金融", "区域级重点客户", "12"], ["2019Q1", "汽车金融", "-", "3"],
                            ["2018Q3", "汽车金融", "-", "3"], ["2018Q4", "汽车金融", "-", "3"], ["2018Q1", "汽车金融", "-", "3"],
                            ["2019Q1", "汽车金融", "一般客户", "53"], ["2018Q3", "汽车金融", "一般客户", "46"],
                            ["2018Q4", "汽车金融", "一般客户", "53"], ["2018Q1", "汽车金融", "一般客户", "28"],
                            ["2019Q1", "网络小贷", "SME客户", "39"], ["2018Q3", "网络小贷", "SME客户", "34"],
                            ["2018Q4", "网络小贷", "SME客户", "39"], ["2018Q1", "网络小贷", "一般客户", "6"],
                            ["2018Q2", "网络小贷", "SME客户", "27"], ["2019Q1", "网络小贷", "公司级重点客户", "11"],
                            ["2018Q3", "网络小贷", "公司级重点客户", "11"], ["2018Q4", "网络小贷", "公司级重点客户", "11"],
                            ["2018Q1", "网络小贷", "区域级重点客户", "8"], ["2018Q2", "网络小贷", "公司级重点客户", "11"],
                            ["2019Q1", "网络小贷", "-", "1"], ["2018Q3", "网络小贷", "-", "1"], ["2018Q4", "网络小贷", "-", "1"],
                            ["2018Q1", "网络小贷", "SME客户", "23"], ["2019Q1", "网络小贷", "一般客户", "10"],
                            ["2018Q3", "网络小贷", "一般客户", "10"], ["2018Q4", "网络小贷", "一般客户", "10"],
                            ["2018Q1", "网络小贷", "公司级重点客户", "9"], ["2018Q2", "网络小贷", "一般客户", "8"],
                            ["2019Q1", "网络小贷", "区域级重点客户", "12"], ["2018Q3", "网络小贷", "区域级重点客户", "11"],
                            ["2018Q4", "网络小贷", "区域级重点客户", "12"], ["2018Q2", "网络小贷", "区域级重点客户", "8"]]}}

assemble_table(rsp)
